%     .................................................
%             ____  _       _   ____  _____   _        
%            |  _ \| |     |_| |  _ \|  ___| |_|       
%            | |_) | |___   _  | |_) | |___   _        
%            |  _ /|  _  | | | |  _ /|___  | | |       
%            | |   | | | | | | | |    ___| | | |       
%            |_|   |_| |_| |_| |_|   |_____| |_|       
%     .................................................
%     PhiPsi:     a general-purpose computational      
%                 mechanics program written in Fortran.
%     Website:    http://phipsi.top                    
%     Author:     Fang Shi  
%     Contact me: shifang@ustc.edu.cn     

% This file sets viewing angle for 3D problems.
% Firstly written on 2021-09-03.
% 说明: 可以通过Matlab查看<属性查看器查询视角参数.

% Set Viewing angle.

function PhiPsi_Viewing_Angle_Settings

%----------------------------
%--------  OPTION 1  --------
%----------------------------
view(16,27)                                   %View

% campos([3.416977998622062,-1.805221682601521,3.986921568415443])  %Camera position
% camtarget([0.1,0.247,0.0225])                                     %Camera target
% camup([0.237724408316712,0.929427433706093,0.28222641826196])     %Camera up vector
% camva(6.867)    

%----------------------------
%--------  OPTION 2  --------
%----------------------------
% view(29.490234375,59.259765625)                                   %View

% campos([3.416977998622062,-1.805221682601521,3.986921568415443])  %Camera position
% camtarget([0.1,0.247,0.0225])                                     %Camera target
% camup([0.237724408316712,0.929427433706093,0.28222641826196])     %Camera up vector
% camva(6.867)                                                      %Camera view angle

%----------------------------
%--------  OPTION 3  --------
%----------------------------
% view(47,32)                                   %View, For FracMan, 2022-08-23.



%----------------------------
%--------  OPTION 4  --------
%----------------------------
% view(90,0)                                   %Y-Z视图, 2022-09-13.

%----------------------------
%--------  OPTION 5  --------
%----------------------------
% view(0,0)                                    %X-Z视图, 2022-09-13.

%----------------------------
%--------  OPTION 6  --------
%----------------------------
% view(0,90)                                    %X-Y视图, 2022-09-13.

% end
 
